src/cf/Documents/bon_РегистрацияНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_РегистрацияНоминальныхОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_СведенияОНоминальныхОбъектах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминальногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоминальныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Держатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/bon_СведенияОНоминальныхОбъектах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СведенияОНоминальныхОбъектах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_ТелефоныНомОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ТелефоныНомОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотовый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/bon_РегистрацияНоминальныхОбъектов/Ext/ObjectModule.bsl
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок)
	Для Каждого СтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.Номер) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнен Номер", Отказ, Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.НоминальныйОбъект) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнен Номинальный Объект", Отказ, Заголовок);
		КонецЕсли;
		//Если Не ЗначениеЗаполнено(СтрокаНоминальныеОбъекты.Держатель) Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В строке " + СтрокаНоминальныеОбъекты.НомерСтроки + " не заполнено Держатель", Отказ, Заголовок);
		//КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок);

	НаборДвиженийСведения = Движения.bon_СведенияОНоминальныхОбъектах;

	Для Каждого СтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		НоваяЗапись = НаборДвиженийСведения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаНоминальныеОбъекты);
		НоваяЗапись.Период 					= Дата;
		НоваяЗапись.Автор					= Автор;
		НоваяЗапись.ПериодДействияНачало 	= "";
		НоваяЗапись.ПериодДействияКонец 	= "";
		НоваяЗапись.Подразделение			= ЭтотОбъект.Подразделение; 
		
		спр = СтрокаНоминальныеОбъекты.НоминальныйОбъект.ПолучитьОбъект();   
		спр.Наименование = Строка(СтрокаНоминальныеОбъекты.Держатель);
		спр.Держатель = СтрокаНоминальныеОбъекты.Держатель;
		спр.Записать();
		
		СтрокаНоминальныеОбъекты.НоминальныйОбъект = спр.Ссылка;
		
	КонецЦикла;	
	Записать();	
	
	Если Не Отказ Тогда
		НаборДвиженийСведения.Записать();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
////////////////////////////////////////////////////////////////////////////////


Процедура ПриКопировании(ОбъектКопирования)
	НоминальныеОбъекты.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	//ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок);
		ПроставитьДержателя();
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПроставитьДержателя()
	
	Для Каждого Строка Из НоминальныеОбъекты Цикл  
		НаборЗаписей = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.bon_НоминальныеОбъекты.Установить(Строка.НоминальныйОбъект);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0  Тогда
			Для Каждого Стр Из НаборЗаписей Цикл 
				Если Не ЗначениеЗаполнено(Стр.Контрагенты) Тогда
					Стр.Контрагенты = Строка.Держатель;
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
////////////////////////////////////////////////////////////////////////////////
